 ## pandas

In [2]:
import pandas as pd

In [3]:
my_data = pd.read_csv("Titanic_Data.csv")

In [4]:
type(my_data)

pandas.core.frame.DataFrame

In [5]:
my_data.shape

(891, 12)

In [6]:
#keys() gives the features in the input 
my_data.keys()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
#loc to be used when index is categorized
#categorical data : 1. nominal : no need to order 2.ordinal : need to be ordered 
#iloc to be used when index is numerical

In [8]:
an = my_data.loc[:5,["Age","Name"]]
an

    Age                                               Name
0  22.0                            Braund, Mr. Owen Harris
1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  26.0                             Heikkinen, Miss. Laina
3  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4  35.0                           Allen, Mr. William Henry
5   NaN                                   Moran, Mr. James

In [9]:
an = my_data.iloc[:5,[2,3]]
an

   Pclass                                               Name
0       3                            Braund, Mr. Owen Harris
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3                             Heikkinen, Miss. Laina
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       3                           Allen, Mr. William Henry

In [15]:
my_data.loc[::-1,::-1].head()
#row inversed and column inversed

,Embarked,Cabin,Fare,Ticket,Parch,SibSp,Age,Sex,Name,Pclass,Survived,PassengerId
890,Q,NaN,7.75,370376,0,0,32.0,male,"Dooley, Mr. Patrick",3,0,891
889,C,C148,30.00,111369,0,0,26.0,male,"Behr, Mr. Karl Howell",1,1,890
888,S,NaN,23.45,W./C. 6607,2,1,NaN,female,"Johnston, Miss. Catherine Helen ""Carrie""",3,0,889
887,S,B42,30.00,112053,0,0,19.0,female,"Graham, Miss. Margaret Edith",1,1,888
886,S,NaN,13.00,211536,0,0,27.0,male,"Montvila, Rev. Juozas",2,0,887

In [11]:
# Counting males who survived
x=  my_data[my_data["Sex"]=="male"]
x.shape

(577, 12)

In [14]:
# top 5 males listed in the data who survived.
x[x["Survived"]==1].head()
# head prints top 5 value

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S